АлогистикТест2/src/Catalogs/СерийныеНомера/СерийныеНомера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерийныеНомера</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>Продан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКиЗГИСМ</name>
    <type>
      <types>DefinedType.НомерКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDTID</name>
    <type>
      <types>DefinedType.RFIDTID</types>
    </type>
  </attributes>
  <attributes>
    <name>RFIDUser</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RFIDEPC</name>
    <type>
      <types>DefinedType.RFIDEPC</types>
    </type>
  </attributes>
  <attributes>
    <name>EPCGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГИСМ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовыйМеханизмУчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/СерийныеНомера/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	
	// Не выполнять дальнейшие действия при обмене данными
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый") И ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый Тогда
		//Заполнить регистр свободных номеров
		РегистрыСведений.алк_СвободныеСерийныеНомера.ДобавлениеСерийногоНомера(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	// Не выполнять дальнейшие действия при обмене данными
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ЭтоНовый = ЭтоНовый();
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый);
	
	Если ЭтоНовый Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	СерийныеНомера.Ссылка
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|ГДЕ
		|	СерийныеНомера.Наименование = &Наименование
		|	И СерийныеНомера.Владелец = &Владелец";
		
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Запрос.УстановитьПараметр("Наименование", СокрЛП(Наименование));
		
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			Отказ = Истина;
			
			ТекстСообщения = НСтр("ru = 'У номенклатуры %1% уже введен серийный номер %2%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1%", Владелец);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2%", СокрЛП(Наименование));
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(ЭтотОбъект, ТекстСообщения,,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИнтеграцияГИСМВызовСервера.ЭтоНомерКиЗ(Наименование) Тогда
		НомерКиЗГИСМ =Наименование;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
